       01  REG-ALUNO.
           03 ID-ALUNO             PIC 9(03).
           03 NM-ALUNO             PIC X(20).
           03 TL-ALUNO.
               05 FONEAREA         PIC 9(02).
               05 FONENUMERO       PIC 9(09).
