       01  REG-INTER.
           03 ID-ALUNO             PIC 9(03).
           03 NM-ALUNO             PIC X(20).
           03 TL-ALUNO.
              05 FONEAREA          PIC 9(02).
              05 FONENUMERO        PIC 9(09).
           03 ID-MATERIA           PIC 9(03).
           03 NM-MATERIA           PIC X(20).
           03 NT-APROVACAO         PIC 9(02)V99.
           03 MD-ALUNO             PIC 9(02)V99.
           03 ST-APROVACAO         PIC X(10).
