       01  REG-MATERIA.
           03 ID-MATERIA           PIC 9(03).
           03 NM-MATERIA           PIC X(20).
           03 NT-APROVACAO         PIC 9(02)V99.
