       01  REG-UNIAO.
           03 ID-ALUNO             PIC 9(03).
           03 NM-ALUNO             PIC X(20).
           03 TL-ALUNO             PIC X(09).
           03 ID-MATERIA           PIC 9(03).
           03 NM-MATERIA           PIC X(20).
           03 NT-APROVACAO         PIC 9(04)V2.
           03 MD-ALUNO             PIC 9(04)V2.
           03 ST-APROVACAO         PIC X(09).
