      ******************************************************************
      * Author:  Emerson Pinheiro
      * Date:    29/03/2022 - 20:03
      * Purpose: Aprendizado Cobol - ALÔ MUNDO EM COBOL
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Program01.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "Hello world"
           STOP RUN.
       END PROGRAM Program01.
/
